"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
class Database {
    constructor() {
        this.horof = {
            horof_jar: ["من", "إلى", "عن", "على", "في", "رب", "ب", "ك", "ل", "مذ", "منذ", "حتى", "خلا", "عدا",
                "حاشا"],
            horof_atf: ["و", "ف", "ثم", "أو", "أم", "بل"],
            horof_jawab: ["لا", "نعم", "بلى", "إي", "أجل", "جلل"],
            horof_nafi: ["لم", "لما", "لن", "ما", "لن", "لا", "لات", "إن"],
            horof_shart: ["إن", "إذما", "لو", "لولا", "لوما", "أما"],
            horof_tahded: ["ألا", "هلا", "لولا", "لوما"],
            horof_masdareh: ["أن", "كي", "كي", "لو", "ما"],
            horof_estiqbal: ["س", "سوف"],
            horof_tanbeh: ["ها", "يا"],
            horof_tawked: ["ل", "قد"],
            horof_astfham: ["من", "أي", "ما", "ماذا", "أين", "متى", "كيف", "كم", "أيان"],
            akhwat_ena: ["إن", "أن", "كأن", "لكن", "ليت", "لعل", "ذين"],
        };
        this.asma = {
            asma_eshara_With_ha: ["ذا", "ذه", "ذي", "تي", "ته", "ذان", "ذين", "تان", "تين", "ولاء"],
            asma_eshara_Without_ha: ["ذاك", "تيك", "ذلك", "تلك", "ذانك", "تانك", "أولئك"],
            asma_mosol: ["الذي", "التي", "اللذان", "الذين", "اللتان", "اللتين", "الذين", "الألى", "اللاتي",
                "اللائي"],
            khamsa: ["أبو", "أبا", "أبي", "أخو", "أخا", "أخي", "حمو", "حما", "حمي", "فو", "فا", "في", "ذو", "ذا", "ذي"],
            dharf_zaman: ["حين", "صباح", "مساء", "ظهر", "ساعة", "دقيقة", "ثانية", "سنة", "أمس", "يوم", "ليلة", "غدوة", "بكرة", "سحرا", "غدا",
                "صباحا", "مساء", "ابدا", "قط", "حينا"],
            dharf_makan: ["خلف", "قدام", "وراء", "فوق", "عند", "مع", "إزاء", "هنا", "يمين", "شمال", "ميل", "فرسخ", "كيلو"]
        };
        this.afal = {
            akhwat_kana: ["كان", "أصبح", "أضحى", "ظل", "أمسى", "بات", "ما زال", "ما برح", "ما انفك", "ما فتئ", "ما دام",
                "صار", "ليس"],
        };
    }
    insert(word) {
    }
    fetch(word) {
    }
}
exports.default = Database;
//# sourceMappingURL=Database.js.map