export default class Database {
    horof: object;
    asma: object;
    afal: object;
    verbs: object;

    constructor() {

        this.horof = {
            "حرف جر": ["من", "إلى", "عن", "على", "في", "رب", "ب", "ك", "ل", "مذ", "منذ", "حتى", "خلا", "عدا",
                "حاشا"],

            "حرف عطف": ["و", "ف", "ثم", "أو", "أم", "بل"],

            "حرف جواب": ["لا", "نعم", "بلى", "إي", "أجل", "جلل"],

            "حرف نفي": ["لم", "لما", "لن", "ما", "لن", "لا", "لات", "إن"],

            "حرف شرط": ["إن", "إذما", "لو", "لولا", "لوما", "أما"],

            "حرف تحضيض": ["ألا", "هلا", "لولا", "لوما"],

            "حرف مصدري": ["أن", "كي", "كي", "لو", "ما"],

            "حرف استقبال": ["س", "سوف"],

            "حرف تنبيه": ["ها", "يا"],

            "حرف توكيد": ["ل", "قد"],

            "حرف استفهام": ["من", "أي", "ما", "ماذا", "أين", "متى", "كيف", "كم", "أيان"],

            "حرف ناسخ": ["إن", "أن", "كأن", "لكن", "ليت", "لعل", "ذين"],
        };

        this.asma = {
            "حرف إشارة": ["ذا", "ذه", "ذي", "تي", "ته", "ذان", "ذين", "تان", "تين", "ولاء", "ذاك", "تيك", "ذلك", "تلك", "ذانك", "تانك", "أولئك"],

            "حرف موصول": ["الذي", "التي", "اللذان", "الذين", "اللتان", "اللتين", "الذين", "الألى", "اللاتي",
                "اللائي"],

            "حرف خمسة": ["أبو", "أبا", "أبي", "أخو", "أخا", "أخي", "حمو", "حما", "حمي", "فو", "فا", "في", "ذو", "ذا", "ذي"],

            "ظرف زمان": ["حين", "صباح", "مساء", "ظهر", "ساعة", "دقيقة", "ثانية", "سنة", "أمس", "يوم", "ليلة", "غدوة", "بكرة", "سحرا", "غدا",
                "صباحا", "مساء", "ابدا", "قط", "حينا"],

            "ظرف مكان": ["خلف", "قدام", "وراء", "فوق", "عند", "مع", "إزاء", "هنا", "يمين", "شمال", "ميل", "فرسخ", "كيلو"]
        };

        this.afal = {
            "فعل ناسخ": ["كان", "أصبح", "أضحى", "ظل", "أمسى", "بات", "ما زال", "ما برح", "ما انفك", "ما فتئ", "ما دام",
                "صار", "ليس"],

        };

        this.verbs = {
            'لازم': {
                "ماض": ['ذهب'],
                "مضارع": ['يذهب'],
                "أمر": ['اذهب']
            },
            'متعدي': {
                "ماض": ['ضرب'],
                "مضارع": ['يضرب'],
                "أمر": ['اضرب']
            }
        };
    }


    fetch(word: string) {
    }


}
